---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalResourceService
source: html/b697e2e7-0fe9-07a0-9722-ea7d7f56699a.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalResourceService Property

The external service which permits registration of an alternate servers for managing external resources such as linked files.

## Syntax (C#)
```csharp
public static ExternalServiceId ExternalResourceService { get; }
```